In [1]:
import numpy as np

In [3]:
import pandas as pd

In [4]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
      'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
      'Sales':[200,120,340,124,243,350]}

In [5]:
# Tic Symbol

In [6]:
df =pd.DataFrame(data = data)

In [7]:
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [8]:
df.groupby('Company')

In [10]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [11]:
df.groupby('Company').count()['Sales']

Company
FB      2
GOOG    2
MSFT    2
Name: Sales, dtype: int64

In [12]:
my_group = df.groupby('Company')

In [13]:
my_group.get_group()

TypeError: get_group() missing 1 required positional argument: 'name'

In [15]:
my_group.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [16]:
my_group.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
Company    6 non-null object
Person     6 non-null object
Sales      6 non-null int64
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [18]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [19]:
my_group.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [20]:
#describe is 5 points of data

In [21]:
# 1. count
# 2. Mean

In [22]:
#3. min max   4.std  5. percentile

In [23]:
my_group.describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [24]:
my_group.describe().transpose()[my_group.describe().transpose() > 150]

Company          FB   GOOG        MSFT
Sales count     NaN    NaN         NaN
      mean   296.50  160.0  232.000000
      std       NaN    NaN  152.735065
      min    243.00    NaN         NaN
      25%    269.75    NaN  178.000000
      50%    296.50  160.0  232.000000
      75%    323.25  180.0  286.000000
      max    350.00  200.0  340.000000

In [25]:
list(my_group)

[('FB',   Company Person  Sales
  4      FB   Carl    243
  5      FB  Sarah    350), ('GOOG',   Company   Person  Sales
  0    GOOG      Sam    200
  1    GOOG  Charlie    120), ('MSFT',   Company   Person  Sales
  2    MSFT      Amy    340
  3    MSFT  Vanessa    124)]